Repository: jupiter248/Weblu
Catalog: src/Weblu.Infrastructure/Localization/Resources/Errors.*.resx
Languages: fa

source: Validation error.
fa: خطای اعتبارسنجی.

source: Service not found.
fa: سرویس یافت نشد.

# SERVICE_TITLE_REQUIRED
source: Service title must have value.
fa: عنوان سرویس الزامی است.

# SERVICE_TITLE_MAX_LENGTH
source: Service title must be less than 200 character
fa: عنوان سرویس باید کمتر از ۲۰۰ کاراکتر باشد.

# SERVICE_DESCRIPTION_REQUIRED
source: Service description must have value.
fa: توضیحات سرویس الزامی است.

# SERVICE_DESCRIPTION_MAX_LENGTH
source: Service description must be less than 500 character.
fa: توضیحات سرویس باید کمتر از ۵۰۰ کاراکتر باشد.

# SERVICE_SHORT_DESCRIPTION_REQUIRED
source: Service short description must have value.
fa: توضیح کوتاه سرویس الزامی است.

# SERVICE_SHORT_DESCRIPTION_MAX_LENGTH
source: Service short description must be less than 350 character.
fa: توضیح کوتاه سرویس باید کمتر از ۳۵۰ کاراکتر باشد.

# SERVICE_BASE_DURATION_REQUIRED
source: Service base duration must have value.
fa: مدت زمان پایه سرویس الزامی است.

# SERVICE_BASE_PRICE_REQUIRED
source: Service base price must have value.
fa: قیمت پایه سرویس الزامی است.

# SERVICE_IS_ACTIVE_REQUIRED
source: Service IsActive must have value.
fa: وضعیت فعال بودن سرویس الزامی است.

source: Feature not found.
fa: ویژگی مورد نظر یافت نشد.

# FEATURE_NAME_REQUIRED
source: Feature name must have value.
fa: نام ویژگی باید مقدار داشته باشد.

# FEATURE_NAME_MAX_LENGTH
source: Feature name must be less than 50 character
fa: طول نام ویژگی باید کمتر از ۵۰ کاراکتر باشد.

# FEATURE_DESCRIPTION_REQUIRED
source: Feature description must have value.
fa: توضیحات ویژگی باید مقدار داشته باشد.

# FEATURE_DESCRIPTION_MAX_LENGTH
source: Feature description must be less than 150 character.
fa: طول توضیحات ویژگی باید کمتر از ۱۵۰ کاراکتر باشد.

source: Method not found.
fa: متد یافت نشد.

# METHOD_NAME_REQUIRED
source: Method name must have value.
fa: نام متد باید دارای مقدار باشد.

# METHOD_NAME_MAX_LENGTH
source: Method name must be less than 50 character
fa: نام متد باید کمتر از ۵۰ کاراکتر باشد.

# METHOD_DESCRIPTION_REQUIRED
source: Method description must have value.
fa: توضیحات متد باید دارای مقدار باشد.

# METHOD_DESCRIPTION_MAX_LENGTH
source: Method description must be less than 150 character.
fa: توضیحات متد باید کمتر از ۱۵۰ کاراکتر باشد.

source: Image not found.
fa: تصویر یافت نشد.

# MEDIUM_FILE_INVALID
source: The uploaded image file is invalid.
fa: فایل تصویر معتبر نیست.

# MEDIUM_ALT_TEXT_LENGTH
source: Alt text cannot exceed the maximum allowed length.
fa: طول متن جایگزین از حد مجاز بیشتر است.

# MEDIUM_ALT_TEXT_REQUIRED
source: Alt text is required for the image.
fa: متن جایگزین برای تصویر الزامی است.

# MEDIUM_FILE_REQUIRED
source: An image file is required.
fa: بارگذاری یک فایل تصویر الزامی است.

# MEDIUM_FILE_SIZE
source: The image file size exceeds the allowed limit.
fa: اندازه فایل تصویر از حد مجاز بیشتر است.

# USERNAME_ALREADY_USED
source: This username is already in use.
fa: این نام کاربری قبلاً استفاده شده است.

# PHONE_NUMBER_ALREADY_USED
source: This phone number is already in use.
fa: این شماره تلفن قبلاً استفاده شده است.

# USER_CREATION_FAILED
source: Failed to create the user.
fa: ایجاد کاربر با شکست مواجه شد.

# ROLE_ADDING_FAILED
source: Failed to assign role to the user.
fa: افزودن نقش به کاربر با شکست مواجه شد.

# INCORRECT_PASSWORD
source: The password is incorrect.
fa: رمز عبور نادرست است.

# USERNAME_REQUIRED
source: Username is required.
fa: نام کاربری الزامی است.

# USERNAME_MAX_LENGTH
source: Username exceeds the maximum allowed length.
fa: طول نام کاربری از حد مجاز بیشتر است.

# USER_FIRST_NAME_MAX_LENGTH
source: First name exceeds the maximum allowed length.
fa: طول نام از حد مجاز بیشتر است.

# USER_FIRST_NAME_REQUIRED
source: First name is required.
fa: نام الزامی است.

# USER_LAST_NAME_MAX_LENGTH
source: Last name exceeds the maximum allowed length.
fa: طول نام خانوادگی از حد مجاز بیشتر است.

# USER_LAST_NAME_REQUIRED
source: Last name is required.
fa: نام خانوادگی الزامی است.

# PHONE_REQUIRED
source: Phone number is required.
fa: شماره تلفن الزامی است.

# INVALID_PHONE
source: The phone number format is invalid.
fa: فرمت شماره تلفن نادرست است.

# PASSWORD_REQUIRED
source: Password is required.
fa: رمز عبور الزامی است.

# PASSWORD_LENGTH
source: Password must meet the minimum length requirement.
fa: طول رمز عبور باید حداقل مقدار مجاز را داشته باشد.

source: User not found.
fa: کاربر یافت نشد.

source: Role not found.
fa: نقش یافت نشد.

source: JWT key not found.
fa: کلید JWT یافت نشد.

source: Refresh token not found.
fa: توکن رفرش یافت نشد.

# REFRESH_TOKEN_REVOKED
source: The refresh token has been revoked.
fa: توکن رفرش باطل شده است.

# REFRESH_TOKEN_USED
source: The refresh token has already been used.
fa: توکن رفرش قبلاً استفاده شده است.

# REFRESH_TOKEN_EXPIRED
source: The refresh token has expired.
fa: توکن رفرش منقضی شده است.

source: Test not found.
fa: .تست پیدا نشد
